<template>
  <div class="Flavor">
    <a class="srcLink" href="https://www.sohu.com/a/293939368_721502">中国顶级常用香料大全！</a>
    <a class="srcLink" href="https://www.sohu.com/a/249673352_683651">家庭常用香料科普大全，千万要收藏！</a>
    <div class="down-content">
      <!-- 目录列表 -->
      <div class="dir-content">
        <div class="hide"></div>
        <div class="note mulu">
          <ol class="contentList note">目录
          </ol>
        </div>
      </div>

      <div class="background">
        <!-- 主题内容 -->
        <div class="test note">
          <div class="title">香料的本质</div>
          <div class="content" style="padding-top:10px;">
            烹调中所用到的香辛味调味品，有的含有多种芳香类的呈味物质，有的带有典型的滋味或香气，且绝大多数都具有一定的药理作用，比如八角、花椒、豆蔻、砂仁、白芷、丁香等。</div>
        </div>
        <div class="test note ">
          <div class="title">香料的功能：调味、增色、添香等</div>
          <ol>
            <li>用香料抑制异味，比如花椒、孜然等，矫正或掩盖原料当中的腥膻异味。</li>
            <li>用香料着色，比如辣椒、芥末、姜黄等，赋予菜品一定的色泽。 </li>
            <li>用香料来赋香，比如八角、桂皮、丁香等，就能改善和增加菜点的香气。</li>
            <li>抗氧化功能，对于大蒜、生姜、花椒、丁香、迷迭香、鼠尾草等香料，由于具有较强的抗氧化作用，并且可以阻止脂肪自动氧化，所以可起到对畜禽肉类及水产类脂肪性食物的防腐保鲜作用。</li>
            <li>抗菌防腐，香料里边含有的抗菌性化合物，如酸、醛、醇、丙酯、酮、醚等成分，能起到防止食物腐败或生成黏液变色、发酵的作用，我们可以把它看作是安全性较高的天然防腐剂。</li>
            <ul class="tips">
              <li>尤其是在卤肉时被广泛的大量使用。夏季天气炎热，卤汤不及时使用可能会坏掉，这时就可以适当的使用一些香辛料进行抗菌防腐。</li>
            </ul>
          </ol>
        </div>
        <div class="test note">
          <div class="title">香料正确的使用方法</div>
          <ul>
            <li>要用真品香料，伪品效果差且可能带有毒性。</li>
            <ul>
              <li>最基本的鉴别方法：外形完整圆润，气味纯正不刺鼻。</li>
            </ul>
            <li>使用前，先用清水洗净，再用热水浸焖片刻。有利于其内部的芳香类呈味物质析出。</li>
            <li>香料应置于食材下方，用量较多时应装入纱布袋。减缓其所含有的挥发性物质遇热后挥发，让食材及汤汁充分吸收香料的香气和滋味。</li>
            <li>香料要合理搭配并控制好用量：由于香料的种类繁多，性味各异，而且菜肴原料的性质不一，所以在香料搭配的种类、比例以及用量多少、投放顺序等方面都应根据香料的性质去确定。</li>
            <ul class="tips">
              <li>香料是带有独特香味的中药材，食药两用、药食同源</li>
              <li>一个简单实用又相较合理的香料配伍方法：上｜中｜下五香配伍法<br>上五香料为君药，中五香料为臣药，下五香料为佐药与使药</li>
              <ul>
                <li class="triangle">君药针对主病或主症起主要治疗作用。特点：味数少，用量大，药力强等。</li>
                <li class="triangle">臣药辅助君药加强治疗。特点：味数稍多于君药，用量与药力较君药小。</li>
                <li class="triangle">佐药加强君、臣药治疗作用或直接治疗次要症状。</li>
                <li class="triangle">使药在方剂中具有引经与调和作用。</li>
              </ul>
            </ul>
          </ul>
        </div>
        <div class="test note">
          <div class="title">香料的分类</div>
          <ol>
            <li>按作用</li>
            <ol class="letterLi">
              <li>辛辣料：辣椒、花椒、麻椒、黑胡椒、白胡椒、荜拔。</li>
              <li>芳香料：八角、桂皮、小茴香、草果、肉豆蔻、草扣、白扣、红扣、香叶、丁香、木香、砂仁、甘松、灵草、排草、孜然、千里香、百里香、五加皮、香菜籽等。</li>
              <li>去异料：白芷、川穹、毛桃、三奈、良姜、桂枝、生姜、南姜、干姜等。</li>
              <li>上色料：紫草、姜黄、栀子等。</li>
              <li>和味料：山楂、陈皮、槟榔、枳壳、罗汉果、甘草等。</li>
              <li>滋补料：黄芪、党参、当归等。</li>
            </ol>
            <li>按成分</li>
            <ol class="letterLi">
              <li>单一成分的香辛料</li>
              <li>数种混合的混合香辛料</li>
            </ol>
            <li>按味型</li>
            <ol class="letterLi">
              <li>苦香料：木香、肉豆蔻、山姜，荜菝、白豆蔻、香砂、草豆蔻、红蔻、草果、砂仁、山奈、良姜、木香、白芷、陈皮、栀子等。</li>
              <li>芳香料：八角，香叶、小茴香、孜然、丁香、肉桂、桂枝、香叶、孜然、麝香、檀香、莳萝籽、白苏、紫苏、薄荷、留兰香、藿香、罗勒、迷迭香、百里香、鼠尾草、甘松、香茅草等。</li>
            </ol>
          </ol>
          <div class="note">用作厨房的香料主要是“十三香”，主要包括花椒、大料、肉桂、良姜、白芷、紫蔻、砂仁、肉蔻、丁香、小茴香、木香、三奈、干姜等<br>
            <span style="padding:0 5px ;">•</span>其配比一般应为：花椒、大料各5份，肉桂、陈皮、良姜、白芷各2份，其余各1份。
          </div>
          <div class="title" style="padding-top: 20px;font:bold 18px;">“十三香”的类型及使用：</div>
          <div class="note">
            <ul>
              <li>辛温型——五香，八角、肉桂、小茴、花椒、丁香。以八角、丁香为主，其它的为辅。一般适合家庭小吃、瓜子、制酱等，适用范围广泛，适合大众口味。</li>
              <ul>
                <li>一般市场上的五香粉都以小茴、碎桂皮为主，八角、丁香很少，所以没有味道</li>
              </ul>
              <li>麻辣型：五香的基础上加青川椒、荜菠、胡椒、豆蔻、干姜、草果、良姜等。
              </li>
              <ul>
                <li>在烧制当中，要投入适当的辣椒，以达到有辣、麻的口感。</li>
                <li>用法各异：在椒子和花椒可用热油炒，达到香的感觉；也有磨成粉状；也有全部投进锅中煮水用…看个人喜好，都可以。</li>
              </ul>
              <li> 浓香型：在一般材料的基础上加香砂、肉蔻、豆蔻、辛庚，进口香叶。</li>
              <ul>
                <li>制成特有的香味，如香肠、烧鸡、卤鸡和高档次的烧烤。</li>
              </ul>
              <li>怪味型：草果、草蔻、肉蔻、木香、山奈、青川椒、千年健、五加皮、杜仲另加五香以煮水。</li>
              <ul>
                <li> 这种口味给人以清新的感觉。</li>
              </ul>
              <li>滋补型：如天麻、罗汉果、当参、当归蔓长、肉桂作为辅料，佐以甲鱼、母鸡、狗肉之类。</li>
              <ul>
                <li>大补：壮阳补肾、益气补中，增强人体免疫力。</li>
              </ul>
            </ul>
          </div>
        </div>
        <div class="test note">
          <div class="title">50种香料简介</div>
          <div class="img-block"></div>
        </div>
        <!-- 卤水 -->
        <div class="test note">
          <div class="title">川式卤水</div>
          <ol>
            <li>配方<br>八角25克 桂皮15克 小茴15～25克甘草10克三奈10克 甘菘3～5克 花椒20克 砂仁10克 草豆蔻5克草果15克 丁香5～15克 生姜100克 大葱150克绍酒100克冰糖350～500克
              味精15克 精盐350～500克 鲜汤5000克精炼油50克 纱布袋2个
            </li>
            <li>调制</li>
            <ol>
              <li>将八角、桂皮、小茴、甘草、三奈、甘菘、花椒、砂仁、草豆蔻、草果、丁香等分成两份，分别装入宽松的纱布袋中并用细绳扎紧袋口；姜洗净拍破；葱连根须洗净挽结。</li>
              <li>将大块的冰糖先在火上炙烤一下，然后放在菜板上轻轻敲碎，再与精炼油一同入锅，用小火炒至呈深红色时，掺入500克沸水搅匀，即成糖色。</li>
              <li>锅置火上，掺入鲜汤5000克，放入姜葱，调入精盐、味精和糖色，再放入香料包，烧沸后改用小火慢慢地熬至香味四溢时，即成新鲜卤水。</li>
            </ol>
            <li>需要注意的问题</li>
            <ol>
              <li>炒糖色时，必须用小火慢炒，且糖色应稍嫩一些，否则炒出的糖色有苦味。</li>
              <li>
                按传统方法调制的卤水通常都不加味精，但由于新鲜卤水大都鲜味不足，加之近年来人们对鲜味的要求似乎已越来越高，所以在调制的过程中也可适量加入的味精。需要说明的是，在卤水中加入味精并不会起副作用，因为味精在160℃以上的温度中才会产生焦谷酸钠从而失去鲜味，而卤水沸腾时的温度一般不会超过
                105℃。</li>
              <li>卤水中一般应加入嫩糖色，如此才会使卤水有回甜味。而加入了嫩糖色以后，便可以不再加甘草。但从药物性能角度看，甘草有调和诸味及提鲜的作用。因此，在加了糖色以后，卤水中仍可考虑加少许甘草。</li>
              <li>丁香中含有丁香油酚，其味甚浓，使用时可根据具体情况调整用量。一般来说，5000克鲜汤中丁香用量应控制在5～15克之间。</li>
              <li>用于制作卤水的大葱应保留其根须，那样可使卤水的味道更香。这可是一位多年制作卤水的老师傅传授给笔者的经验。</li>
              <li>上述卤水配方中加有糖色，且色呈棕红，称为红卤，若去掉配方中的糖色便成了白卤。另外有人爱在卤水中加入干辣椒，那样就变成辣卤了。</li>
            </ol>
          </ol>

        </div>
        <div class="test note">
          <div class="title"> 海鲜卤水</div>
          <ol>
            <li>
              原料<br>草果、花椒、干辣椒各5克，当归、甘草、小茴香各3克，白豆蔻4克，香叶10克，八角8克，桂皮2克，胡萝卜、精盐、芹菜段、香菜段、青红椒、广东米酒各50克，姜、葱各20克，味达美酱油100克，虾油、冰糖各10克，海鲜生抽75克，泰国鱼露25克，蔻嘉卤水汁3克，香糟卤15克，鸡汁5克，特级汤王20克。
            </li>
            <li>制作</li>
            <ul>
              <li style="list-style-type: circle;">特点：色泽棕红，咸鲜微甜、微辣。</li>
              <li style="list-style-type: circle;">应用：适合卤制海鲜软体类、贝壳类，如鲜鱿鱼、虾蛄、基围虾、海螺、香螺、海瓜子、蛤蜊、膏蟹。</li>
            </ul>
            <ol>
              <li>将草果、当归、白蔻、香叶、小茴、花椒、八角、甘草、桂皮、干辣椒洗净晾干，用纱布包裹成香料包。</li>
              <li>芹菜段、青红椒（去蒂去籽后切片）、姜（拍破）、葱（拍松）、胡萝卜切片均备用。</li>
              <li>汤锅内放入清水20公斤，加入料包、精盐、冰糖、味达美酱油、虾油、海鲜生抽、泰国鱼露、广东米酒、冠佳卤水汁、香糟卤、鸡汁、芹菜段、香菜段、青红椒、姜、葱、胡萝卜大火烧开，小火加盖熬半小时，放凉后过滤即成。
              </li>
            </ol>
            <li>注意事项</li>
            <ol>
              <li>培植海鲜卤水时用料要齐备，否则难以形成卤水特有的风味，香料投放比例可根据食客口味略作加减，卤水卤制的是海鲜原料，海鲜以清淡为主，故香料选用的比例一定要前后统一，以免产生过浓或过淡的现象。
              </li>
              <li>此卤水卤制海鲜原料的时间不易过长，以免海鲜变老，其方法是将所卤制的原料经过初步处理，治净内脏及泥沙，经氽水后再放入卤水锅内，上火烧开后立刻端锅离火，放凉后浸泡约2小时，捞出即可。
              </li>
              <li>此卤水以清淡味鲜为主，在熬制过程中不需加油，但要将出锅的菜肴拌上适量的葱油，以增加成品香味、光泽。
              </li>
              <li>因为海鲜的腥味较重，所以此卤水不宜长期反复使用，使用两次以后，即要更换新卤水。</li>
            </ol>
          </ol>
        </div>
        <div class="test note">
          <div class="title">潮汕卤水</div>
          <ul>
            <li style="list-style-type: circle;">特点：色泽红亮，口味香醇。</li>
            <li style="list-style-type: circle;">应用：可以用来卤制鸭头、鸭脖子、猪蹄、猪肚、乳鸽、兔子头等。</li>
          </ul>
          <ol>
            <li>原料</li>
            <ol class="letterLi">
              <li>海天鲜味生抽2500克，美极鲜酱油1500克，冰糖2200克，片糖1550克，金杯牌泰国原汁鱼露750克，双鹤牌玫瑰露酒480克，粤山牌花雕酒600克，家乐牌鸡精900克，盐500克。
              </li>
              <li>干海马1对，干蛤蚧1对，猪骨7500克，老鸡4500克，烧鸭的鸭骨1500克，火腿肉250克，火腿骨500克，瑶柱250克，鱿鱼2只，大地鱼3只。
              </li>
              <li>花生油2500克，蒜瓣1500克，葱750克，香菜250克，洋葱150克，桂皮10克，八角10粒,草果8只，香叶15克，香果5只，白豆蔻5粒。
              </li>
              <li>八角、桂皮各50克，花椒10克，白胡椒、甘草各100克，香叶40克，丁香15克，陈皮5只，草果15粒，罗汉果2只，小茴香30克，白芷5克，香果、肉豆蔻各10粒，沙姜片150克。
              </li>
              <li>南姜2500克（去皮后约1500克），肉姜500克，香菜250克（洗净装袋）。
              </li>
              <li>姜500克，南姜1500克，葱900克，香菜250克（洗净待用）。
              </li>
              <li>色拉油2000克。</li>
            </ol>
            <li>制作</li>
            <ol>
              <li>
                B料中的干海马、蛤蚧、大地鱼入锅中小火火局10分钟至干待用；瑶柱、鱿鱼洗净，放入烧至六成热的色拉油中小火浸炸3分钟待用；老鸡去头、去屁股后洗净，放入沸水中大火汆5分钟，取出后放入烧至八成热的色拉油中小火浸炸3分钟，取出备用；鸭骨，猪骨、火腿肉、火腿骨放入沸水中大火汆5分钟待用。
              </li>
              <li>不锈钢桶中放入清水30千克，把以上待用的放入桶内慢火煮2小时；将F料放入桶中煮3个小时离火，过3小时后过滤。
              </li>
              <li>锅内放入花生油，小火烧至六成热时放蒜瓣、葱、香菜、洋葱、八角、草果（草果拍烂）、桂皮、香叶、香果、白豆蔻小火浸炸15分钟，捞出待用。
              </li>
              <li>将D料用水洗净，浸泡10分钟装袋备用。
              </li>
              <li>
                将汤大火烧滚，转慢火放入E料、D料和A料中的生抽、美极鲜酱油、冰糖、片糖、鸡精、盐慢慢搅动，待糖溶解后倒入炸后的C料大火烧开，最后放鱼露、花雕酒、玫瑰露酒搅匀后关火，过5小时后把卤水过滤，把袋装的东西连袋放回卤水内便成了潮州卤水。
              </li>
            </ol>
          </ol>
        </div>
        <div class="test note">
          <div class="title">卤水的使用及保管方法</div>
          <ol>
            <li>卤水的使用</li>
            <ol>
              <li>凡动物性原料在卤制前均需先做氽水处理，否则原料直接下锅后，会导致卤水急剧减少，从而造成菜品口味过咸。</li>
              <li>一锅上好的卤水，应经常卤制鲜味较浓的动物性原料，这样才能增加卤水的鲜香味。有一句行话叫做“卤水越老越好”，讲的就是这个道理。</li>
              <li>猪肉和鸡、鸭、鹅、兔这类鲜香味较浓的原料，应与异味较重的牛、羊肉及各种动物“下水”如肥肠原料分开使用卤水，以保证卤水和卤制菜品的质量。</li>
              <li>在使用过程中，要经常检查卤水的色泽、香味、咸度以及汤汁是否充足等，一旦发现某方面有所减少应及时补上，即我们常说的“缺啥补啥”。</li>
            </ol>
            <li>卤水的保管</li>
            <ol>
              <li>卤水经过一段时间的使用后，会留下少数原料或香料的残渣，这时便需要进行过滤，以此来保证卤水的质量。</li>
              <li>
                卤水经反复使用后汤汁会变得比较浓稠，虽经过滤，但还需“清扫”，即用干净的动物血液与清水混合后，徐徐加入到烧沸的卤水中，这便是利用蛋白质的吸附和凝固作用，吸去卤水中的杂质，以使卤水变得清澈，讲究一些的还要用瘦肉茸对卤水进行“清扫”。但需注意，每锅卤水清扫的次数不能过多，以免卤水失去鲜香味。
              </li>
              <li>卤水中浮油要经常打掉，最好使卤水表面只保留薄薄的一层“油面子”。否则，油脂过多，容易使卤水变质?脂肪氧化变质所致。</li>
              <li>
                卤水在不使用时，应烧沸后放入搪瓷桶内，令其自然冷却，且不要随意晃动。另外，桶底还应垫上砖块，以保持底部通风。若是夏天，卤水必须每天烧沸，如果有条件，还可放入冷库中存放。卤水在长期不用时，也应时常从冷库中取出烧沸，冷却后再放入库中。以上仅是笔者制作川式卤水的一点经验和体会。但烹饪是变化之学，所以读者在调制川式卤水时，还应根据具体情况灵活地掌握卤水的用料及调制方法，这样才能调制出令人满意的卤水来。
              </li>
            </ol>
          </ol>
        </div>
      </div>
    </div>



  </div>
</template>

<script>
import arr from "@/data/note.js"
export default {
  components: {
  },
  data() {
    //所定义的组件的数据
    return {
      arr: arr,

    };
  },
  methods: {

  },
  mounted() {
    let fragmentImg = document.createDocumentFragment();
    for (let i = 0; i < arr.length; i++) {
      let item = arr[i];
      let textDiv = document.createElement("div");
      let imgDiv = document.createElement("div");
      // div.style.backgroundImage = "url("+let item.imgSrc+")";
      textDiv.className = "imgText";
      textDiv.innerHTML = item.text;
      imgDiv.style.backgroundImage = "url(" + item.imgSrc + ")";
      imgDiv.className = "imgHover";
      textDiv.appendChild(imgDiv);
      // 此处往文档片段插入子节点，不会引起回流 （相当于打包操作）
      fragmentImg.appendChild(textDiv);
    };
    // arr.forEach((item) => {
    //   let div = document.createElement("div");
    //   div.style.backgroundImage = "url(item.imgSrc)";
    //   div.className = "imgText";
    //   div.innerHTML = item.text;

    //   // 此处往文档片段插入子节点，不会引起回流 （相当于打包操作）
    //   fragment.appendChild(div);
    // });

    document.getElementsByClassName("img-block")[0].appendChild(fragmentImg);



    let fragmentTitle = document.createDocumentFragment();
    let arrTitle = [];
    length = document.getElementsByClassName("title").length;
    for (let i = 0; i < length; i++) {

      document.getElementsByClassName("title")[i].id = "titleAhref" + i
      let title = document.getElementsByClassName("title")[i].innerHTML;
      arrTitle.push(title);
      let titleLi = document.createElement("li");
      let hrefLi = document.createElement("a");
      hrefLi.href = "#titleAhref" + i;
      hrefLi.className = "titleLink";
      hrefLi.innerHTML = arrTitle[i];
      titleLi.appendChild(hrefLi);
      fragmentTitle.appendChild(titleLi);
    };

    document.getElementsByClassName("contentList")[0].appendChild(fragmentTitle);
  },
};
</script>
  
<style scoped>
@import "@/scss/note.css"
</style>
  